import nextcord

TOKEN = "" #/// โทเคนบอท
ownerid = [239901961623830528, 22, 22] # /// ใส่ไอดีคนที่เราจะให้ใช้คำสั่งได้


# /// ใส่ลิ้งรูปหน้า Embed ต้องใส่ก่อนใช้คำสั่งก่อนรันนะครัง
image = ""  # ใส่ลิ้งรูป ไม่งั้นจะใช้คำสั่งไม่ได้ (ย้ำ ✅)



# //// โมดูลที่ต้องติดตั้ง Python 3.11 + 3.12 เท่านั้น

# pip install nextcord
# pip install colorama
# pip install requests



#### ///// ไอดีช่องต่างๆ \\\\\
admin_log = 1347632993417564222 # /// ใส่ไอดีช่องแอดมิน
log_top = 1347632993417564222 # /// ใส่ไอดีช่องเติมเงินสำเร็จ
log_role = 1347632993417564222 #/// ไอดีช่องส่งยศ
log_embed = 1347632960244940841 # #/// ไอดีช่อง ที่ใช้งาน คำสั่ง /setup ที่หน้าเมนู


#### /////  ตั่งค่ารับเงิน ต้องตั้ง (ย้ำ ✅) config.py ///// 

phone = "" # /// ใส่เบอร์รับเงิน
APIKEY = "" # /// เอาคีย์รับซองมาใส่หักรายการละ 0.1 ทักหา icewen_2 เพื่อขอวิธีเอาค่ย์